""" Royhat """

# Chuntirish 

"""
    len(word) - Определяет длину переменной word.
    
    word.upper() - Преобразует строку к верхнему регистру.
    
    print(word.capitalize()) - Выводит содержимое переменной так, чтобы каж-
            дое слово начиналось с буквы верхнего регистра, 
            а все остальные буквы были в нижнем регистре.
    
    word.lower() - Преобразует строку к нижнему регистру.

    name = firstname + surname - Соединяет firstname и surname, не разделяя их 
            пробелами. Эта операция называется конкатенацией.

    phrase.title() - Изменяет phrase так, чтобы каждое сло-
            во начиналось с буквы верхнего регистра, 
            а все остальные буквы были в нижнем реги-
            стре (так называемый «титульный регистр»).

    text = " This is some text. " - Удаляет лишние символы
            (в данном случае пробелы) в начале и в конце строки
    print(text.strip(" "))

    print ( "Hello world " [7:10] ) - index bo'yicha o bilan d ni chaqririb oladi



"""